{
  "2025-11-10": "I started with NVDA, and it was so choppy that it did not work for the first 3 times, \n-The risk was in check, so the loss was okay; however, I took another one 4th for the breakout, and it still didn't work (should've walked out as NVDA was proven choppy)\n-Took TSLA for a VWAP Breakdown 2 times, as the risk was in check, and it went in my favor\n-Took NVDA again and took a loss, lost my state of mind and took a revenge trade on QBTS without thinking it through\n-QBTS worked in my favor; however, it could've gone badly\n-Another QBTS high of the day breakout as the volume started increasing\n\n\nPsychology was compromised",
  "2025-11-20": "For high of day breakouts, Please wait for it to break the high (go below the high) and then come back again in the next few minutes to confirm that the move is genuine",
  "2025-11-28": "I started the day with NVDA short, which is my PML breakout trade\nI shifted to Google for a PML long as it was a strong breakout\nWent NVDA short for a VWAP Breakdown\nWent to PLTR long for a VWAP Breakout with a small size, as I wasn't confident enough\nSame for NVDA short with fewer shares\n\n\nPsychology- Was Calm, Cool, and Collected, didn't feel FOMO or ROMO.\nDay- The morning was more or less choppy",
  "2025-12-01": "Today was a different day\nRight when I started the software, nothing felt exciting, and all the stocks seemed the same in terms of movement\nI heard online that there is less volume in the market today, which gave me a little bit of a bias\n\nWhen I started the day, I did not go full size in any of the tickers and stuck with 10-20% of buying power\nSmall wins were there, but we could not capture the big moves\n\nPsychology- Was Calm, Cool, and collected and a bit underconfident (did not take any risk)\nDay- Some stocks gave good moves, but there were a lot of rejections on the stocks",
  "2025-11-26": "First day of the account wanted to do something big and took big risks and took trades I shouldn't have\nI knew I should stop, but I traded as I had a huge room. Today was the day you set back and relax\nPsychology - Scared and emotional\nDay- Very Choppy",
  "2025-12-02": "Started off strong as the market was really nice today\n-NVDA was the first trade but I went with 40% of my BP as the market has been choppy the past couple of days\n-Second trade was TSLA but i chickend out as it was a B quality setup and had a huge chance of failing\n\nPsychology - Calm cool and collected\nDay - Nice trading opportunities throughout the day",
  "2025-12-03": "Today was a horrible day\nI overtraded and had terrible losses, \nI took TSLA with a full position as I thought the market was back on track, but that didn't happen, and the market is still choppy.\nI am creating some rules to avoid days like these now-\nWhen I have a loss 1st trade (big loss), I will take a 15-minute break (shut down the systems for 15 minutes)\nI will restrict my total trades to just 2 more ( 3 in total) or stop trading\nMy Max loss will not exceed $100 now. Also, always take Trades near VWAP; if not, do a quick scalp! (Only VWAP and PML Breakouts)\nNo more 100% BP, 50% max\nPsychology- Good, but once I got my 1st loss, I forgot all my rules and didn't see what was obvious\nDay- Super Choppy",
  "2025-12-04": "I was eager to take a trade, so I feel I did not take the best setup and traded B-quality stuff\nNow I will only stick to 2 trade books, 1 -VWAP BREAKOUTS/DOWNS or PML breakouts.\n\nPsychology- Messed up \nDay - Not bad",
  "2025-12-05": "I was really scared when the day started\n2nd trade was not in my playbook \n\n****Ashish Please Please Please Do not trade 1 min ORBs*** \n\nit does not go well for you\nStick to your strategies PLM Breakouts or VWAP Breakouts, whenever you have taken any other trades it has gone very bad for you.\n\nPsychology - Scared\nDay - Not bad\n",
  "2025-12-08": "Only take trades near the VWAP and stick to only VWAP Breakouts from now on\nSave your self and your mental energy\nDo no trade any thing else",
  "2025-12-09": "The Day was super duper choppy\nI followed my strategy for all the trades I took today, so it's not frustrating, although the entries could've been better.\nToday, all the stocks were choppy, and the strategy was not working for any of them\n\nPsychology - Calm, Cool and Collected\nDay -Super choppy",
  "2025-12-10": "Today was the Day my account blew up\nI lost my account on the market chop, and had bad day trading habits\nI do not feel angry or sad as I grew up a lot from this challenge and found the core problems I had, for example, overtrading, taking B quality setups or trading the emotion (taking random trades and hoping)\nNow I know what to do and have decided on how to move ahead with the challenge.\nI am doing a 30 Day demo account now so that I can be back on track and basically skip this month, as I feel this entire month will be like this due to the lack of volume in this period.\nAfter the 30-day period is done, we will come back and start another day trading challenge, where I will buy an account once again and see if it works for me.\nRight now, I will settle for the rules I have made and honour them with discipline (check the rules page).",
  "2025-12-11": "I feel I should take fewer trades and define my risk, as I realized that usually I am correct in predicting the movement of the stock, but keep a very tight stop loss or my entry is not good, which results in me getting stopped out a lot for small profits vs the big losses when it doesn't work.\n\nIf I start giving the trade enough room to breathe and only stick to my strategies, take A+ trades, and follow my plan, I can easily be profitable\n\nPsychology- It was a bit messed up as it did not work 2 times in ORCL, then I went mad and had big losses (recovered it, but I took a lot of B quality setups)\nDay - Good for trading, actually",
  "2025-12-12": "Today was an amazing day with all my strategies working\nNFLX was a PML breakout; the rest of the stocks I traded were VWAP Breakout/downs.\n\n\n\nPsychology - Calm, Cool, and Collected ( I figured if I use 50% of my BP, my emotions are always in check)\nDay - Amazing with a lot of opportunities and stocks in play (clean)",
  "2025-12-15": "I traded ORCL, which was not in play today. My strategy was in check, but it went against me and stopped me out.\nPLTR was in play; however, it moved with the market and stopped me out\nI took another  trade on PLTR right away, which should've been avoided (I took the trade because of the setup, honestly, but it did not work in my favour)\n\nPsychology - I feel after the TSLA trade, my psychology was a bit compromised, but overall calm, cool and collected\nDay - Some trading opportunities\n\n**Entries could've been better to minimize the losses\n**Do not take a trade right away on a stock after a loss",
  "2025-12-16": "I need to cut my size even more and risk $25 at max\nThe VWAP strategy did not work for me \nI am stuck and have no idea what needs to be done. I follow my rules and always end up in the red. I should stop trading for a while now.\nIf a stock rejects your VWAP breakout, it's highly likely it will reject again, so don't trade it again.",
  "2025-12-17": "The strategy is failing and when it happens i tend to take bad trades\nAshish, do not over trade and stick to your strategy this month is not very good for breakouts\nRelax and believe in your self",
  "2025-12-18": "Today was a good day, a lot of opportunities.\nI am thinking if i start trading only the QQQs, which are the market and always have volume, I can have a successful RR. I will put the QQQs more in my list from now on and try to trade them more often, mostly for VWAP Breakouts/downs\nAlso, don't trade low price stocks\n\nPsychology- Calm, cool, and collected\nDay - Good",
  "2025-12-19": "It's all about the entry\nI think I am going to reduce or cut out the PML B strategy\n3 Trades all in the playbook\n\nPshycology- Good\nDay- Amazing for Semis",
  "2025-12-22": "In terms of Discipline and Strategy, the day was really nice; I wasn't tempted to take a trade or do anything.\nThe 1.5R partial is working really nicely for me, as my R:R has improved drastically\nI chose NVDA, which was choppy. I should've looked at the way it was acting earlier\n\nPsychology- Calm\nDay- Decent",
  "2025-12-23": "Today the markets were a bit choppy, We did not get any continuations and had a lot of fake breakouts.\nTook the first trade becuase other people took it, had a big loss because no entry exit criteria and really bad position.\n\nPshycology - Okay\nDay - Choppy\n",
  "2025-12-24": "Today was a difficult day as all the stocks were stuck in a range and was a bit choppy following the QQQs\n\nPsychology - Good\nDay - Okay"
}